Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_law/solvit.html.txt.tmx
Source language: en
Languages: ga

source: Solving problems accessing rights in other EU Member States
ga: Réiteach fadhbanna le rochtain ar chearta i mBallstáit eile den AE

source: As a citizen of the European Union (EU) you can go to another EU country to live, study, work or retire
ga: Mar shaoránach den Aontas Eorpach (AE) is féidir leat dul chuig tír eile den AE chun cónaí, stáidéar, obair nó chun scor den obair

source: Your rights in these areas are contained in the Internal Market law of the EU
ga: Tá do chearta sna ceantair sin le fáil i ndlí Mhargaidh Inmhéanach an AE

source: They may be subject to certain conditions and limits
ga: D’fhéadfadh sé sin teacht faoi réir coinníollacha agus srianta áirithe

source: Member states of the EU/EEA are mainly responsible for implementing these rules and properly applying them
ga: Is iad ballstáit an AE/LEE is mó a bhíonn freagrach as na rialacha seo a chur i bhfeidhm i gceart

source: Occasionally, citizens and businesses of EU/EEA member states who move and conduct business between member states face problems from the possible misapplication of Internal Market law by member states
ga: Ó am go chéile bíonn fadhbanna ag saoránaigh agus gnólachtaí de chuid Bhallstáit an AE/LEE a bhogann agus a riarann gnó idir Ballstáit le mífheidhmiú féideartha dhlí an Mhargaidh Inmheánaigh ag Ballstáit

source: You may have the right to appeal these administrative decisions
ga: B’fhéidir go mbeidh an ceart agat achomhrac a dhéanamh i gcoinne na gcinntí riaracháin sin

source: Here we explain how to appeal these decisions through the SOLVIT service and the steps you need to take if you wish to make an appeal
ga: Mínítear anseo conas achomhrac a thabhairt i gcoinne na gcinntí sin tríd an tseirbhís SOLVIT agus na céimeanna nach foláir duit a ghlacadh más mian leat achomrac a dhéanamh

source: The SOLVIT service is an EU/EEA service that attempts to resolve problems faced by citizens and businesses caused by the misapplication of Internal Market law without the need for legal action
ga: Is seirbhís de chuid an AE/LEE í SOLVIT a dhéanann iarracht na fadhbanna os comhair saoránaigh agus ag gnólachtaí de bharr mhífheidhmiú dhlí an Mhargaidh Inmheánaigh a réiteach gan a dhul i mbun chaingean dlí

source: SOLVIT is a free, confidential service that is available to anyone throughout the EU who feels they have not been able to avail of their Internal Market rights because the administration in another member state is misapplying Internal Market law
ga: Is seirbhís shaor in aisce agus rúnda í SOLVIT a bhíonn ar fáil do dhuine ar bith ar fud an AE a shíleann nárbh fhéidir leo a gcearta faoin Margadh Inmheánach a fháil toisc riarachán i mBallstát eile a bheith ag mífheidhmiú dhlí an Mhargaidh Inmheánaigh

source: In order to bring an issue to SOLVIT you must be an EU/EEA citizen
ga: Caithfidh tú a bheith i do shaoránach de chuid an AE/LEE chun saincheist a chur faoi bhráid SOLVIT

source: Your complaint must be in relation to the misapplication of Internal Market law by an EU/EEA member state
ga: Caithfidh do ghearán a bheith i ndáil le mífheidhmiú dhlí an Mhargaidh Inmheánaigh ag Ballstát den AE/LEE

source: (See below for a list of websites and organisations where you can check what your Internal Market rights are)
ga: (Féach thíos le haghaidh liosta de shuímh Idirlín agus eagraíochtaí inar féidir leat do chearta faoi dhlí an Mhargaidh Inmheánaigh a sheiceáil)

source: It is important to be aware that the SOLVIT service cannot help in certain cases (see ‘Cases where SOLVIT cannot help’ below)
ga: Tá sé tábhachtach go mb’fheasach duit nach féidir leis an tseirbhís SOLVIT cabhrú i gcásanna áirithe (Féach ‘Cásanna nach féidir le SOLVIT cabhrú leat’ thíos)

source: If, however, SOLVIT agrees to take your case, it will confirm within 1 week that it will act on your behalf
ga: Má ghlacann SOLVIT le do chás, áfach, dearbhóidh sé laistigh de sheachtain amháin go bhfeidhmeoidh sé ar do shon

source: The normal timeframe for resolution of appeals is 10 weeks, however this may be extended in certain circumstances
ga: Is é an gnáthfhráma ama do réiteach na n-achomhrac ná 10 seachtaine; d’fhéadfaí é seo a shíneadh i gcúinsí áirithe ámh

source: What sort of areas can SOLVIT help with?
ga: Cén cineál réimsí inar féidir le SOLVIT cabhrú leat?

source: • Recognition of Professional Qualifications: (i.e., doctors, nurses, engineers, etc.)
ga: • Aithint na gCáilíochtaí Gairmiúla (.i. dochtúirí, altraí, innealtóirí srl.)

source: Cases where SOLVIT cannot help
ga: Cásanna nach féidir le SOLVIT cabhrú leat

source: • Instances where legal proceedings are already under way
ga: • Imthosca mar a bhíonn imeachtaí dlí ar siúl cheana féin

source: • Where the problem relates to a legal obstacle, e.g
ga: • Mar a mbaineann bac dlí leis an bhfadhb, m.sh

source: where the problem concerns an obstacle that results from a legal provision of national law
ga: má bhaineann an fhadhb le bac atá ann mar thoradh ar fhoráil dhlíthiúil den dlí náisiúnta

source: In this situation, it is unlikely that an informal system such as SOLVIT would be able to provide redress
ga: Sa chás sin, ní dócha go mbeadh córas neamhfhoirmeálta cosúil le SOLVIT in ann sásamh a sholáthar

source: • Where deadlines under national law need to be respected
ga: • Mar ar ghá urraim a thabhairt do spriocanna faoin dlí náisiúnta

source: • Where the problem is a business-to-business or business-to-consumer one
ga: • Nuair is fadhb idir dhá ghnólacht nó idir gnólacht agus custaiméir atá inti

source: In the event of a Business-to-Consumer issue, you need to contact your nearest European Consumer Centre
ga: I gcás shaincheist idir Gnólacht agus Custaiméir, beidh ort dul i dteagmháil leis an Ionad Eorpach do Thomhaltóirí is gaire duit

source: In the event of a Business-to-Business issue, you will need to seek redress through the Courts
ga: I gcás shaincheist idir dhá Ghnólacht, beidh ort sásamh a chuardach sna Cúirteanna

source: SOLVIT works as part of the national Government of each member state, so there is a network of SOLVIT centres through the EU
ga: Oibríonn SOLVIT mar chuid de Rialtas náisiúnta gach ballstát, agus tá gréasán d’ionaid SOLVIT ar fud an AE dá réir

source: If you are not certain of your rights (i.e., whether you have a valid complaint), you may like to get in touch with the following before referring the matter to SOLVIT
ga: an bhfuil gearán bailí agat), b’fhéidir go mba mhaith leat dul i dteagmháil leis na heagraíochtaí seo a leanas sula gcuireann tú an ní faoi bhráid SOLVIT

source: Europe Direct provides a free telephone and e-mail service and acts as a first point of contact for information about the EU
ga: Soláthraíonn Europe Direct seirbhís ghutháin agus ríomhphoist shaor in aisce agus feidhmíonn mar an chéad phointe teagmhála le haghaidh eolas i dtaobh an AE

source: It offers information on a wide range of subjects including the rights of EU citizens
ga: Tairgeann sí eolas ar raon leathan ábhar lena n-áirítear cearta shaoránaigh an AE

source: It can also refer users to the best source of advice at EU, national, regional and local levels
ga: Féadann sé úsáideoirí a tharchur freisin chuig an bhfoinse comhairle is fearr ag leibhéil an AE, go náisiúnta, go réigiúnach agus go háitiúil

source: Your Europe Advice: Provides expert legal advice on the rights of citizens in the EU
ga: D'Eoraip Comhairle: Soláthraíonn sainchomhairle dlí faoi chearta shaoránaigh an AE

source: There is also advice for the business community in the EU
ga: Dialóg leis an Lucht Gnó: Soláthraíonn comhairle don lucht gnó san AE

source: Enterprise Europe Network: Provides information, advice and assistance to Small Business Enterprises in the EU
ga: Líonra Fiontar Eorpach: Soláthraíonn eolas, comhairle agus cúnamh do Ghnóthais Bheaga san AE

source: The European Commission Representation in Ireland can give free legal advice on your single market rights
ga: Féadann Ionadaíocht an Choimisiúin Eorpaigh in Éirinn comhairle dhlí shaor in aisce a thabhairt duit faoi do chearta sa mhargadh aonair

source: You can read more about the process of making an appeal under ‘How to apply’ below
ga: Is féidir leat tuilleadh a léamh thíos faoi phróiseas dhéanamh na n-achomhrac

source: Outcomes of using the SOLVIT service
ga: Torthaí úsáid na seirbhíse SOLVIT

source: Proposed solutions through the SOLVIT service are non-binding on the person making the complaint
ga: Bíonn na réitigh a mholtar tríd an tseirbhís SOLVIT neamhcheangailteach ar an ngearánaí

source: If the applicant is unhappy with the proposed solution, or if the problem goes unresolved, more formal proceedings (i.e., legal proceedings at national or Community level) can be initiated
ga: Mura mbíonn an t-iarratasóir sásta leis an réiteach a mholtar, nó mura mbíonn réiteach ar an bhfadhb, is féidir imeachtaí níos foirmiúla (.i. imeachtaí dlí ag an leibhéal náisiúnta nó ag leibhéal an Chomhphobail) a thionscnamh

source: It is also important to note, that SOLVIT does not provide advocacy services on behalf of citizens or businesses in the EU
ga: Tá sé tábhachtach go dtabharfaí faoi deara nach soláthraíonn SOLVIT seirbhísí abhcóideachta ar son saoránach ná gnólachtaí san AE

source: They do not have any role in influencing policy, administration, etc
ga: Ní bhíonn tionchar ar bith acu ar chúrsaí beartais, riaracháin srl

source: However, the European Commission closely monitor each SOLVIT centre, checking the type, volume and nature of appeals and to ensure that caseloads are progressing
ga: Déanann an Coimisiún Eorpach dianmhonatóireacht ar gach ionad SOLVIT, ámh, chun cineál, líon agus ábhar na n-achomrac a sheiceáil agus chun a chinntiú go mbíonn dul chun cinn á dhéanamh ar ualach na gcásanna

source: This is a free service – there is no charge for making an appeal to the service
ga: Is seirbhís shaor in aisce í seo – ní ghearrtar aon mhuirear ar achomrac chuig an tseirbhís

source: You should submit your complaint to the SOLVIT service online
ga: Ba cheart duit do ghearán a thaisceadh le seirbhís SOLVIT ar líne

source: You should include as much detail as possible
ga: Ba chóir duit an oiread mionsonraí agus ab fhéidir a áireamh leis

source: Your local SOLVIT Centre (known as the "Home" SOLVIT Centre) will contact you within 1 week
ga: Déanfaidh d’Ionad SOLVIT Áitiúil (ar a dtugtar Ionad "Baile" SOLVIT) teagmháil leat laistigh de 1 seachtain amháin

source: If you have a valid cause for complaint, your local SOLVIT Centre will forward it to the SOLVIT Centre in the other member state where the problem has occurred (known as the "Lead" SOLVIT Centre)
ga: Má bhíonn cúis bhailí ghearáin agat, seolfaidh d’Ionad SOLVIT áitiúil ar aghaidh í chuig an Ionad SOLVIT sa bhallstát eile inar tharla an fhadhb (ar a dtugtar an tIonad "Ceannais" SOLVIT)

source: The two SOLVIT Centres will liaise with each other during the period of investigation and your Home SOLVIT Centre will keep you informed of progress, and the proposed solution
ga: Rachaidh an dá Ionad SOLVIT i gcomhairle lena chéile i rith na tréimhse imscrúdaithe agus is é d’Ionad Baile SOLVIT a choinneoidh tú ar an eolas i leith dul chun cinn, agus i leith an réitigh mholta
